app/controllers/produits_controller.rb

  def index
    @produits = Produit.all
---
SELECT "produits".* FROM "produits"

  def create
    @produit = Produit.new(produit_params)

    respond_to do |format|
      if @produit.save
---
INSERT INTO "produits" ("created_at", "description", "nom", "photo", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", "2014-07-25 15:56:30.169404"], ["description", ".......descriptioooonnn <3"], ["nom", "test1"], ["photo", "lol"], ["updated_at", "2014-07-25 15:56:30.169404"]]

  def destroy
    @produit.destroy
---
DELETE FROM "produits" WHERE "produits"."id" = ?  [["id", 1]]

    def set_produit
      @produit = Produit.find(params[:id])
---
SELECT  "produits".* FROM "produits"  WHERE "produits"."id" = ? LIMIT 1  [["id", 1]]